3-Sinter_vs_Microchannel_Comparison/1uW_load_envelope/Ag_1p0_s10p5/constant/domain1/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/domain1/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    inlet
    {
        type            patch;
        nFaces          400;
        startFace       69200;
    }
    outlet
    {
        type            patch;
        nFaces          400;
        startFace       69600;
    }
    domain1_to_solid_wall
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          4800;
        startFace       70000;
        sampleMode      nearestPatchFace;
        sampleRegion    solid_wall;
        samplePatch     solid_wall_to_domain1;
    }
)

// ************************************************************************* //
