3-Sinter_vs_Microchannel_Comparison/1uW_load_envelope/Ag_1p0_s10p5/constant/g
FoamFile
{
    version     2.0;
    format      ascii;
    class       uniformDimensionedVectorField;
    object      g;
}
dimensions  [ 0 1 -2 0 0 0 0 ];
value       ( 0 0 0 );
