3-Sinter_vs_Microchannel_Comparison/1uW_load_envelope/Ag_1p0_s10p5/system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}

// Top-level SIMPLE controls for chtMultiRegionSimpleFoam
SIMPLE
{
    nNonOrthogonalCorrectors 2;
}
